tony-josi-aws/STM32F439ZI_FreeRTOS_TCP_CLI/Lib/FreeRTOS-Plus-CLI/app_main.c
/* Standard includes. */
#include <stdio.h>
#include <stdlib.h>

/* Kernel includes. */
#include "FreeRTOS.h"
#include "task.h"

/* STM includes. */

#include "main.h"

#include "stm32f4xx_hal.h"

#include "stm32f4xx_hal_eth.h"

/* ST includes. */
#if defined( STM32F7xx )
    #include "stm32f7xx_hal.h"
    #define CACHE_LINE_SIZE    32u
#elif defined( STM32F4xx )
    #include "stm32f4xx_hal.h"
#elif defined( STM32F2xx )
    #include "stm32f2xx_hal.h"
#elif defined( STM32F1xx )
    #include "stm32f1xx_hal.h"
#elif !defined( _lint ) /* Lint does not like an #error */
    #error What part?
#endif /* if defined( STM32F7xx ) */


/* FreeRTOS+TCP includes. */
#include "FreeRTOS_IP.h"
#include "FreeRTOS_Sockets.h"

/* Logging includes. */
#include "logging.h"

/* CLI includes. */
#include "FreeRTOS_CLI.h"

/* Pcap capture includes. */
#include "pcap_capture.h"

#include "iperf_task.h"

#include "user_commands.h"

#include "plus_tcp_demo_cli.h"

/* Demo definitions. */
#define mainCLI_TASK_STACK_SIZE             512
#define mainCLI_TASK_PRIORITY               ( tskIDLE_PRIORITY )

#define mainUSER_COMMAND_TASK_STACK_SIZE    2048
#define mainUSER_COMMAND_TASK_PRIORITY      ( tskIDLE_PRIORITY )
/*-----------------------------------------------------------*/
/*-------------  ***  DEMO DEFINES   ***   ------------------*/
/*-----------------------------------------------------------*/

#define USE_LOOPBACK_INTERFACE                 0

#define mainCREATE_TCP_LOOPBACK_TASK_SINGLE    0

#define USE_IPv6_END_POINTS                    0

#define USE_UDP                                1

#define USE_TCP                                1

#if ( BUILD_IPERF3 == 1 )
    #define USE_IPERF3                         0
#endif

#define USE_ZERO_COPY                          1

#define USE_TCP_ZERO_COPY                      1

#define USE_USER_COMMAND_TASK                  1

#define USE_TCP_ECHO_CLIENT                    0

#define USE_UDP_ECHO_SERVER                    0

#define USE_TCP_ECHO_SERVER                    0

#define USE_CORE_HTTP_DEMO                     0

/* The standard echo port number. */
#define tcpechoPORT_NUMBER                     7

#if ( ipconfigUSE_IPv6 != 0 && USE_IPv6_END_POINTS != 0 && ipconfigUSE_IPv4 != 0 && USE_LOOPBACK_INTERFACE != 0 )
    #define TOTAL_ENDPOINTS                    ( 4 )
#elif ( ipconfigUSE_IPv6 != 0 && USE_IPv6_END_POINTS != 0 && ipconfigUSE_IPv4 != 0 )
    #define TOTAL_ENDPOINTS                    ( 3 )
#elif ( ipconfigUSE_IPv4 == 0 && ipconfigUSE_IPv6 != 0 && USE_LOOPBACK_INTERFACE != 0 )
    #define TOTAL_ENDPOINTS                    ( 3 )
#elif ( ipconfigUSE_IPv4 == 0 && ipconfigUSE_IPv6 != 0 )
    #define TOTAL_ENDPOINTS                    ( 2 )
#elif ( ipconfigUSE_IPv4 != 0 && USE_LOOPBACK_INTERFACE != 0 )
    #define TOTAL_ENDPOINTS                    ( 2 )
#else
    #define TOTAL_ENDPOINTS                    ( 1 )
#endif /* ( ipconfigUSE_IPv6 != 0 && USE_IPv6_END_POINTS != 0 ) */

#if USE_LOOPBACK_INTERFACE
    #define  TOTAL_INTERFACES    ( 2 )
#else
    #define  TOTAL_INTERFACES    ( 1 )
#endif

#define UDP_ECHO_PORT            5005


#if ( mainCREATE_TCP_LOOPBACK_TASK_SINGLE == 1 && USE_LOOPBACK_INTERFACE == 1 )
    struct freertos_sockaddr xParamsLoopBackServerAddr;
#endif

#if USE_TCP_ECHO_SERVER
struct freertos_sockaddr xParamsTCPEchoServerAddr = { 0 };
#endif

/*-----------------------------------------------------------*/
/*-----------------------------------------------------------*/
/*-----------------------------------------------------------*/

/* Logging module configuration. */
#define mainLOGGING_TASK_STACK_SIZE    256
#define mainLOGGING_TASK_PRIORITY      ( tskIDLE_PRIORITY + 1 )
#define mainLOGGING_QUEUE_LENGTH       100

#define mainMAX_UDP_RESPONSE_SIZE      1024
/*-----------------------------------------------------------*/

#include "pack_struct_start.h"
struct xPacketHeader
{
    uint8_t ucStartMarker;
    uint8_t ucPacketNumber;
    uint16_t usPayloadLength;
    uint8_t ucRequestId[ 4 ];
}
#include "pack_struct_end.h"
typedef struct xPacketHeader PacketHeader_t;

#define PACKET_HEADER_LENGTH    sizeof( PacketHeader_t )
#define PACKET_START_MARKER     0x55
/*-----------------------------------------------------------*/

uint32_t ulTim7Tick = 0;

extern UART_HandleTypeDef huart3;

BaseType_t xEndPointCount = 0;
BaseType_t xUpEndPointCount = 0;

const uint8_t ucMACAddress[ 6 ] = { configMAC_ADDR0, configMAC_ADDR1, configMAC_ADDR2, configMAC_ADDR3, configMAC_ADDR4, configMAC_ADDR5 };

static BaseType_t xTasksAlreadyCreated = pdFALSE;

extern RNG_HandleTypeDef hrng;

static char cInputCommandString_UDP[ configMAX_COMMAND_INPUT_SIZE + 1 ];
static char cInputCommandString_TCP[ configMAX_COMMAND_INPUT_SIZE + 1 ];

TaskHandle_t network_up_task_handle;
BaseType_t network_up_task_create_ret_status, network_up;

#if defined( ipconfigIPv4_BACKWARD_COMPATIBLE ) && ( ipconfigIPv4_BACKWARD_COMPATIBLE == 0 )

    NetworkInterface_t * pxSTM32Fxx_FillInterfaceDescriptor( BaseType_t xEMACIndex,
                                                             NetworkInterface_t * pxInterface );

#endif

/*-----------------------------------------------------------*/



#if USE_TCP

    #define TCP_ECHO_RECV_DATA    0

    static uint8_t ucTcpResponseBuffer[ mainMAX_UDP_RESPONSE_SIZE + PACKET_HEADER_LENGTH ];

    static void prvCliTask_TCP( void * pvParameters );
    static BaseType_t prvSendResponseEndMarker_TCP( Socket_t xCLIServerSocket,
                                                    struct freertos_sockaddr * pxSourceAddress,
                                                    socklen_t xSourceAddressLength,
                                                    uint8_t * pucPacketNumber,
                                                    uint8_t * pucRequestId );
    static BaseType_t prvSendCommandResponse_TCP( Socket_t xCLIServerSocket,
                                                  struct freertos_sockaddr * pxSourceAddress,
                                                  socklen_t xSourceAddressLength,
                                                  uint8_t * pucPacketNumber,
                                                  uint8_t * pucRequestId,
                                                  const uint8_t * pucResponse,
                                                  uint32_t ulResponseLength );
    static void TCP_Server_Task( void * pvParams );

    #if TCP_ECHO_RECV_DATA

