tony-josi-aws/STM32F439ZI_FreeRTOS_TCP_CLI/Lib/FreeRTOS-Plus-CLI/app_main.c
        static BaseType_t prvSendResponseBytes_TCP( Socket_t xCLIServerSocket,
                                                    const uint8_t * pucResponse,
                                                    uint32_t ulResponseLength );
    #endif /* TCP_ECHO_RECV_DATA */

#endif /* USE_TCP */


#if USE_UDP

    #if USE_TCP
        #define configCLI_SERVER_PORT_UDP    1235
    #else
        #define configCLI_SERVER_PORT_UDP    configCLI_SERVER_PORT
    #endif /* USE_TCP */

    static uint8_t ucUdpResponseBuffer[ mainMAX_UDP_RESPONSE_SIZE + PACKET_HEADER_LENGTH ];

    static void prvCliTask( void * pvParameters );

    static BaseType_t prvSendResponseEndMarker( Socket_t xCLIServerSocket,
                                                struct freertos_sockaddr * pxSourceAddress,
                                                socklen_t xSourceAddressLength,
                                                uint8_t * pucPacketNumber,
                                                uint8_t * pucRequestId );

    static BaseType_t prvSendCommandResponse( Socket_t xCLIServerSocket,
                                              struct freertos_sockaddr * pxSourceAddress,
                                              socklen_t xSourceAddressLength,
                                              uint8_t * pucPacketNumber,
                                              uint8_t * pucRequestId,
                                              const uint8_t * pucResponse,
                                              uint32_t ulResponseLength );

#endif /* USE_UDP */

static void prvConfigureMPU( void );

static void prvRegisterCLICommands( void );

static BaseType_t prvIsValidRequest( const uint8_t * pucPacket,
                                     uint32_t ulPacketLength,
                                     uint8_t * pucRequestId );

static void network_up_status_thread_fn( void * io_params );

uint32_t time_check = 0;

/*-----------------------------------------------------------*/

void app_main( void )
{
    BaseType_t xRet;

    prvConfigureMPU();

    /* Register all the commands with the FreeRTOS+CLI command
     * interpreter. */
    prvRegisterCLICommands();

    xRet = xLoggingTaskInitialize( mainLOGGING_TASK_STACK_SIZE,
                                   mainLOGGING_TASK_PRIORITY,
                                   mainLOGGING_QUEUE_LENGTH );
    configASSERT( xRet == pdPASS );

    configPRINTF( ( "Calling FreeRTOS_IPInit...\n" ) );
    /*FreeRTOS_IPInit( ucIPAddress, ucNetMask, ucGatewayAddress, ucDNSServerAddress, ucMACAddress ); */
    #if defined( ipconfigIPv4_BACKWARD_COMPATIBLE ) && ( ipconfigIPv4_BACKWARD_COMPATIBLE == 0 )
        static NetworkInterface_t xInterfaces[ TOTAL_INTERFACES ];
        static NetworkEndPoint_t xEndPoints[ TOTAL_ENDPOINTS ];
    #endif /* #if defined(ipconfigIPv4_BACKWARD_COMPATIBLE) && ( ipconfigIPv4_BACKWARD_COMPATIBLE == 0 ) */
    /*FreeRTOS_debug_printf((“FreeRTOS_IPInit\r\n”)); */


    /* Initialize the network interface.*/
    #if defined( ipconfigIPv4_BACKWARD_COMPATIBLE ) && ( ipconfigIPv4_BACKWARD_COMPATIBLE == 0 )
        /* Initialize the interface descriptor for WinPCap. */
        pxSTM32_FillInterfaceDescriptor( 0, &( xInterfaces[ 0 ] ) );

        /* === End-point 0 === */
    #if ( ipconfigUSE_IPv4 != 0 )
        /* === End-point 0 === */
        {
            const uint8_t ucIPAddress[ 4 ] = { configIP_ADDR0, configIP_ADDR1, configIP_ADDR2, configIP_ADDR3 };
            const uint8_t ucNetMask[ 4 ] = { configNET_MASK0, configNET_MASK1, configNET_MASK2, configNET_MASK3 };
            const uint8_t ucGatewayAddress[ 4 ] = { configGATEWAY_ADDR0, configGATEWAY_ADDR1, configGATEWAY_ADDR2, configGATEWAY_ADDR3 };
            const uint8_t ucDNSServerAddress[ 4 ] = { configDNS_SERVER_ADDR0, configDNS_SERVER_ADDR1, configDNS_SERVER_ADDR2, configDNS_SERVER_ADDR3 };
            const uint8_t ucMACAddress[ 6 ] = { configMAC_ADDR0, configMAC_ADDR1, configMAC_ADDR2, configMAC_ADDR3, configMAC_ADDR4, configMAC_ADDR5 };

            FreeRTOS_FillEndPoint( &( xInterfaces[ 0 ] ), &( xEndPoints[ xEndPointCount ] ), ucIPAddress, ucNetMask, ucGatewayAddress, ucDNSServerAddress, ucMACAddress );
            #if ( ipconfigUSE_DHCP != 0 )
            {
                /* End-point 0 wants to use DHCPv4. */
                xEndPoints[ xEndPointCount ].bits.bWantDHCP = pdTRUE; /* pdFALSE; // pdTRUE; */
            }
            #endif /* ( ipconfigUSE_DHCP != 0 ) */

            xEndPointCount += 1;
        }

        /* === End-point 1 Loopback === */
    #if USE_LOOPBACK_INTERFACE
        {
            const uint8_t ucLoopbackIPAddress[ 4 ] = { 127, 0, 0, 1 };
            const uint8_t ucLoopbackNetMask[ 4 ] = { 255, 0, 0, 0 };
            const uint8_t ucLoopbackGatewayAddress[ 4 ] = { 0, 0, 0, 0 };
            const uint8_t ucLoopbackDNSServerAddress[ 4 ] = { 0, 0, 0, 0 };
            const uint8_t ucLoopbackMACAddress[ 6 ] = { configMAC_ADDR0, configMAC_ADDR1, configMAC_ADDR2, configMAC_ADDR3, configMAC_ADDR4, configMAC_ADDR5 };

            extern NetworkInterface_t * pxLoopback_FillInterfaceDescriptor( BaseType_t xEMACIndex,
                                                                            NetworkInterface_t * pxInterface );

            pxLoopback_FillInterfaceDescriptor( 0, &( xInterfaces[ 1 ] ) );
            /*xEndPoints[xEndPointCount].bits.bWantDHCP = pdFALSE; */
            FreeRTOS_FillEndPoint( &( xInterfaces[ 1 ] ), &( xEndPoints[ xEndPointCount ] ), ucLoopbackIPAddress, ucLoopbackNetMask, ucLoopbackGatewayAddress, ucLoopbackDNSServerAddress, ucLoopbackMACAddress );

            xEndPointCount += 1;
        }
        #endif /* USE_LOOPBACK_INTERFACE */
        #endif /* ( ipconfigUSE_IPv4 != 0 ) */

        /*
         *     End-point-1 : public
         *     Network: 2001:470:ed44::/64
         *     IPv6   : 2001:470:ed44::4514:89d5:4589:8b79/128
         *     Gateway: fe80::ba27:ebff:fe5a:d751  // obtained from Router Advertisement
         */
    #if ( ipconfigUSE_IPv6 != 0 && USE_IPv6_END_POINTS != 0 )
        {
            IPv6_Address_t xIPAddress;
            IPv6_Address_t xPrefix;
            IPv6_Address_t xGateWay;
            IPv6_Address_t xDNSServer1, xDNSServer2;

            FreeRTOS_inet_pton6( "2001:470:ed44::", xPrefix.ucBytes );

            FreeRTOS_CreateIPv6Address( &xIPAddress, &xPrefix, 64, pdTRUE );
            FreeRTOS_inet_pton6( "fe80::ba27:ebff:fe5a:d751", xGateWay.ucBytes );

            FreeRTOS_FillEndPoint_IPv6( &( xInterfaces[ 0 ] ),
                                        &( xEndPoints[ xEndPointCount ] ),
                                        &( xIPAddress ),
                                        &( xPrefix ),
                                        64uL, /* Prefix length. */
                                        &( xGateWay ),
                                        NULL, /* pxDNSServerAddress: Not used yet. */
                                        ucMACAddress );
            FreeRTOS_inet_pton6( "2001:4860:4860::8888", xEndPoints[ xEndPointCount ].ipv6_settings.xDNSServerAddresses[ 0 ].ucBytes );
            FreeRTOS_inet_pton6( "fe80::1", xEndPoints[ xEndPointCount ].ipv6_settings.xDNSServerAddresses[ 1 ].ucBytes );
            FreeRTOS_inet_pton6( "2001:4860:4860::8888", xEndPoints[ xEndPointCount ].ipv6_defaults.xDNSServerAddresses[ 0 ].ucBytes );
            FreeRTOS_inet_pton6( "fe80::1", xEndPoints[ xEndPointCount ].ipv6_defaults.xDNSServerAddresses[ 1 ].ucBytes );

