tony-josi-aws/STM32F439ZI_FreeRTOS_TCP_CLI/Lib/FreeRTOS-Plus-CLI/app_main.c
            #if ( ipconfigUSE_RA != 0 )
            {
                /* End-point 1 wants to use Router Advertisement */
                xEndPoints[ xEndPointCount ].bits.bWantRA = pdTRUE;
            }
            #endif /* #if( ipconfigUSE_RA != 0 ) */
            #if ( ipconfigUSE_DHCPv6 != 0 )
            {
                /* End-point 1 wants to use DHCPv6. */
                xEndPoints[ xEndPointCount ].bits.bWantDHCP = pdTRUE;
            }
            #endif /* ( ipconfigUSE_DHCPv6 != 0 ) */

            xEndPointCount += 1;
        }

        /*
         *     End-point-3 : private
         *     Network: fe80::/10 (link-local)
         *     IPv6   : fe80::d80e:95cc:3154:b76a/128
         *     Gateway: -
         */
        {
            IPv6_Address_t xIPAddress;
            IPv6_Address_t xPrefix;

            FreeRTOS_inet_pton6( "fe80::", xPrefix.ucBytes );
            FreeRTOS_inet_pton6( "fe80::7009", xIPAddress.ucBytes );

            FreeRTOS_FillEndPoint_IPv6(
                &( xInterfaces[ 0 ] ),
                &( xEndPoints[ xEndPointCount ] ),
                &( xIPAddress ),
                &( xPrefix ),
                10U,  /* Prefix length. */
                NULL, /* No gateway */
                NULL, /* pxDNSServerAddress: Not used yet. */
                ucMACAddress );

            xEndPointCount += 1;
        }
        #endif /* ( ipconfigUSE_IPv6 != 0 && USE_IPv6_END_POINTS != 0 ) */

        FreeRTOS_IPInit_Multi();
    #else /* if defined( ipconfigIPv4_BACKWARD_COMPATIBLE ) && ( ipconfigIPv4_BACKWARD_COMPATIBLE == 0 ) */
        /* Using the old /single /IPv4 library, or using backward compatible mode of the new /multi library. */
        FreeRTOS_debug_printf( ( "FreeRTOS_IPInit\r\n" ) );
        /*memcpy(ipLOCAL_MAC_ADDRESS, ucMACAddress, sizeof ucMACAddress); */
        FreeRTOS_IPInit( ucIPAddress, ucNetMask, ucGatewayAddress, ucDNSServerAddress, ucMACAddress );
    #endif /* defined(ipconfigIPv4_BACKWARD_COMPATIBLE) && ( ipconfigIPv4_BACKWARD_COMPATIBLE == 0 ) */

    /* Task to display network status */
    network_up_task_create_ret_status = xTaskCreate( network_up_status_thread_fn, "network_up_status", 200, "HW from 2", ipconfigIP_TASK_PRIORITY - 1, &network_up_task_handle );
    configASSERT( network_up_task_create_ret_status == pdPASS );

    /* Start the RTOS scheduler. */
    vTaskStartScheduler();

    /* Infinite loop */
    for( ; ; )
    {
    }
}
/*-----------------------------------------------------------*/

#if USE_UDP

    static void prvCliTask( void * pvParameters )
    {
        uint32_t ulResponseLength;
        BaseType_t xCount, xResponseRemaining, xResponseSent;
        Socket_t xCLIServerSocket = FREERTOS_INVALID_SOCKET;
        struct freertos_sockaddr xSourceAddress, xServerAddress;
        socklen_t xSourceAddressLength = sizeof( xSourceAddress );
        TickType_t xCLIServerRecvTimeout = portMAX_DELAY;
        char * pcOutputBuffer = FreeRTOS_CLIGetOutputBuffer();

        ( void ) pvParameters;

        xCLIServerSocket = FreeRTOS_socket( FREERTOS_AF_INET,
                                            FREERTOS_SOCK_DGRAM,
                                            FREERTOS_IPPROTO_UDP );
        configASSERT( xCLIServerSocket != FREERTOS_INVALID_SOCKET );

        /* No need to return from FreeRTOS_recvfrom until a message
         * is received. */
        FreeRTOS_setsockopt( xCLIServerSocket,
                             0,
                             FREERTOS_SO_RCVTIMEO,
                             &( xCLIServerRecvTimeout ),
                             sizeof( TickType_t ) );

        xServerAddress.sin_port = FreeRTOS_htons( configCLI_SERVER_PORT_UDP );

        #if defined( ipconfigIPv4_BACKWARD_COMPATIBLE ) && ( ipconfigIPv4_BACKWARD_COMPATIBLE == 0 )
            xServerAddress.sin_address.ulIP_IPv4 = FreeRTOS_GetIPAddress();
        #else
            xServerAddress.sin_addr = FreeRTOS_GetIPAddress();
        #endif

        xServerAddress.sin_family = FREERTOS_AF_INET;

        FreeRTOS_bind( xCLIServerSocket, &( xServerAddress ), sizeof( xServerAddress ) );

        configPRINTF( ( "Waiting for requests...\n" ) );

        for( ; ; )
        {
            uint8_t ucRequestId[ 4 ];

            #if USE_ZERO_COPY
                uint8_t * pucReceivedUDPPayload = NULL;
                xCount = FreeRTOS_recvfrom( xCLIServerSocket,
                                            &pucReceivedUDPPayload,
                                            0,
                                            FREERTOS_ZERO_COPY,
                                            &( xSourceAddress ),
                                            &( xSourceAddressLength ) );

                configASSERT( ( pucReceivedUDPPayload != NULL ) && ( xCount < configMAX_COMMAND_INPUT_SIZE ) );

                memcpy( ( void * ) ( &( cInputCommandString_UDP[ 0 ] ) ), pucReceivedUDPPayload, xCount );

                FreeRTOS_ReleaseUDPPayloadBuffer( ( void * ) pucReceivedUDPPayload );
            #else /* if USE_ZERO_COPY */
                xCount = FreeRTOS_recvfrom( xCLIServerSocket,
                                            ( void * ) ( &( cInputCommandString_UDP[ 0 ] ) ),
                                            configMAX_COMMAND_INPUT_SIZE,
                                            0,
                                            &( xSourceAddress ),
                                            &( xSourceAddressLength ) );
            #endif /* USE_ZERO_COPY */

            /* Since we set the receive timeout to portMAX_DELAY, the
             * above call should only return when a command is received. */
            configASSERT( xCount > 0 );
            cInputCommandString_UDP[ xCount ] = '\0';

            if( prvIsValidRequest( ( const uint8_t * ) &( cInputCommandString_UDP[ 0 ] ), xCount, &( ucRequestId[ 0 ] ) ) == pdTRUE )
            {
                uint8_t ucPacketNumber = 1;
                #ifdef TIM7_TEST
                    extern uint32_t tim7_period;

                    #if defined( ipconfigIPv4_BACKWARD_COMPATIBLE ) && ( ipconfigIPv4_BACKWARD_COMPATIBLE == 0 )
                        configPRINTF( ( "Received command. IP:%x Port:%u Content:%s TIM7 period ms: %u \n", xSourceAddress.sin_address.ulIP_IPv4,
                                        xSourceAddress.sin_port,
                                        &( cInputCommandString_UDP[ PACKET_HEADER_LENGTH ] ), tim7_period ) );
                    #else
                        configPRINTF( ( "Received command. IP:%x Port:%u Content:%s TIM7 period ms: %u \n", xSourceAddress.sin_addr,
                                        xSourceAddress.sin_port,
                                        &( cInputCommandString_UDP[ PACKET_HEADER_LENGTH ] ), tim7_period ) );
                    #endif
                #else /* ifdef TIM7_TEST */
                    #if defined( ipconfigIPv4_BACKWARD_COMPATIBLE ) && ( ipconfigIPv4_BACKWARD_COMPATIBLE == 0 )
                        configPRINTF( ( "Received command. IP:%x Port:%u Content:%s \n", xSourceAddress.sin_address.ulIP_IPv4,
                                        xSourceAddress.sin_port,
                                        &( cInputCommandString_UDP[ PACKET_HEADER_LENGTH ] ) ) );
                    #else
                        configPRINTF( ( "Received command. IP:%x Port:%u Content:%s \n", xSourceAddress.sin_addr,
                                        xSourceAddress.sin_port,
                                        &( cInputCommandString_UDP[ PACKET_HEADER_LENGTH ] ) ) );
                    #endif
                #endif /* ifdef TIM7_TEST */

                do
                {
                    /* Send the received command to the FreeRTOS+CLI. */
                    xResponseRemaining = FreeRTOS_CLIProcessCommand( &( cInputCommandString_UDP[ PACKET_HEADER_LENGTH ] ),
                                                                     pcOutputBuffer,
                                                                     configCOMMAND_INT_MAX_OUTPUT_SIZE - 1 );

