tony-josi-aws/STM32F439ZI_FreeRTOS_TCP_CLI/Lib/FreeRTOS-Plus-CLI/app_main.c
        FreeRTOS_setsockopt( xCLIServerSocket, 0, FREERTOS_SO_RCVTIMEO, &xReceiveTimeOut, sizeof( xReceiveTimeOut ) );
        FreeRTOS_setsockopt( xCLIServerSocket, 0, FREERTOS_SO_SNDTIMEO, &xSendTimeOut, sizeof( xReceiveTimeOut ) );

        for( ; ; )
        {
            /* Zero out the receive array so there is NULL at the end of the string
             * when it is printed out. */
            memset( pucRxBuffer, 0x00, ipconfigTCP_MSS );

            uint8_t ucRequestId[ 4 ];

            #if USE_TCP_ZERO_COPY
                uint8_t * pucZeroCopyRxBuffPtr = NULL;
                xCount = FreeRTOS_recv( xCLIServerSocket, &pucZeroCopyRxBuffPtr, ipconfigTCP_MSS, FREERTOS_ZERO_COPY );

                if( pucZeroCopyRxBuffPtr != NULL )
                {
                    memcpy( pucRxBuffer, pucZeroCopyRxBuffPtr, xCount );
                    FreeRTOS_ReleaseTCPPayloadBuffer( xCLIServerSocket, pucZeroCopyRxBuffPtr, xCount );
                }
                else
                {
                    xCount = -1;
                }
            #else /* if USE_TCP_ZERO_COPY */
                xCount = FreeRTOS_recv( xCLIServerSocket, pucRxBuffer, ipconfigTCP_MSS, 0 );
            #endif /* USE_TCP_ZERO_COPY */

            /* Since we set the receive timeout to portMAX_DELAY, the
             * above call should only return when a command is received. */
            /*configASSERT( xCount > 0 ); */

            if( xCount > 0 )
            {
                configASSERT( xCount < configMAX_COMMAND_INPUT_SIZE );

                memcpy( cInputCommandString_TCP, pucRxBuffer, xCount );
                cInputCommandString_TCP[ xCount ] = '\0';

                /* Echo the response back */
                /* prvSendResponseBytes_TCP(xCLIServerSocket, cInputCommandString_TCP, xCount + 1); */

                if( prvIsValidRequest( ( const uint8_t * ) &( cInputCommandString_TCP[ 0 ] ), xCount, &( ucRequestId[ 0 ] ) ) == pdTRUE )
                {
                    uint8_t ucPacketNumber = 1;
                    #ifdef TIM7_TEST
                        extern uint32_t tim7_period;

                        #if defined( ipconfigIPv4_BACKWARD_COMPATIBLE ) && ( ipconfigIPv4_BACKWARD_COMPATIBLE == 0 )
                            configPRINTF( ( "Received command. IP:%x Port:%u Content:%s TIM7 period ms: %u \n", xSourceAddress.sin_address.ulIP_IPv4,
                                            xSourceAddress.sin_port,
                                            &( cInputCommandString_TCP[ PACKET_HEADER_LENGTH ] ), tim7_period ) );
                        #else
                            configPRINTF( ( "Received command. IP:%x Port:%u Content:%s TIM7 period ms: %u \n", xSourceAddress.sin_addr,
                                            xSourceAddress.sin_port,
                                            &( cInputCommandString_TCP[ PACKET_HEADER_LENGTH ] ), tim7_period ) );
                        #endif
                    #else /* ifdef TIM7_TEST */
                        #if defined( ipconfigIPv4_BACKWARD_COMPATIBLE ) && ( ipconfigIPv4_BACKWARD_COMPATIBLE == 0 )
                            configPRINTF( ( "Received command. IP:%x Port:%u Content:%s \n", xSourceAddress.sin_address.ulIP_IPv4,
                                            xSourceAddress.sin_port,
                                            &( cInputCommandString_TCP[ PACKET_HEADER_LENGTH ] ) ) );
                        #else
                            configPRINTF( ( "Received command. IP:%x Port:%u Content:%s \n", xSourceAddress.sin_addr,
                                            xSourceAddress.sin_port,
                                            &( cInputCommandString_TCP[ PACKET_HEADER_LENGTH ] ) ) );
                        #endif
                    #endif /* ifdef TIM7_TEST */

                    do
                    {
                        /* Send the received command to the FreeRTOS+CLI. */
                        xResponseRemaining = FreeRTOS_CLIProcessCommand( &( cInputCommandString_TCP[ PACKET_HEADER_LENGTH ] ),
                                                                         pcOutputBuffer,
                                                                         configCOMMAND_INT_MAX_OUTPUT_SIZE - 1 );

                        /* Ensure null termination so that the strlen below does not
                         * end up reading past bounds. */
                        pcOutputBuffer[ configCOMMAND_INT_MAX_OUTPUT_SIZE - 1 ] = '\0';

                        ulResponseLength = strlen( pcOutputBuffer );

                        /* HACK - Check if the output buffer contains one of our special
                         * markers indicating the need of a special response and process
                         * accordingly. */
                        if( strncmp( pcOutputBuffer, "PCAP-GET", ulResponseLength ) == 0 )
                        {
                            const uint8_t * pucPcapData;
                            uint32_t ulPcapDataLength;

                            pcap_capture_get_captured_data( &( pucPcapData ),
                                                            &( ulPcapDataLength ) );

                            xResponseSent = prvSendCommandResponse_TCP( xCLIServerSocket,
                                                                        &( xSourceAddress ),
                                                                        xSourceAddressLength,
                                                                        &( ucPacketNumber ),
                                                                        &( ucRequestId[ 0 ] ),
                                                                        pucPcapData,
                                                                        ulPcapDataLength );

                            /* Next fetch should not get the same capture but the capture
                             * after this point. */
                            pcap_capture_reset();
                        }
                        else
                        {
                            /* Send the command response. */
                            xResponseSent = prvSendCommandResponse_TCP( xCLIServerSocket,
                                                                        &( xSourceAddress ),
                                                                        xSourceAddressLength,
                                                                        &( ucPacketNumber ),
                                                                        &( ucRequestId[ 0 ] ),
                                                                        ( const uint8_t * ) pcOutputBuffer,
                                                                        ulResponseLength );
                        }

                        if( xResponseSent == pdPASS )
                        {
                            configPRINTF( ( "Response sent successfully. \n" ) );
                        }
                        else
                        {
                            configPRINTF( ( "[ERROR] Failed to send response. \n" ) );
                        }
                    } while( xResponseRemaining == pdTRUE );

                    /* Send the last packet with zero payload length. */
                    ( void ) prvSendResponseEndMarker_TCP( xCLIServerSocket,
                                                           &( xSourceAddress ),
                                                           xSourceAddressLength,
                                                           &( ucPacketNumber ),
                                                           &( ucRequestId[ 0 ] ) );
                }
                else
                {
                    #if defined( ipconfigIPv4_BACKWARD_COMPATIBLE ) && ( ipconfigIPv4_BACKWARD_COMPATIBLE == 0 )
                        configPRINTF( ( "[ERROR] Malformed request. IP:%x Port:%u Content:%s \n", xSourceAddress.sin_address.ulIP_IPv4,
                                        xSourceAddress.sin_port,
                                        cInputCommandString_TCP ) );
                    #else
                        configPRINTF( ( "[ERROR] Malformed request. IP:%x Port:%u Content:%s \n", xSourceAddress.sin_addr,
                                        xSourceAddress.sin_port,
                                        cInputCommandString_TCP ) );
                    #endif
                }
            }
        }
    }

#endif /* if USE_TCP */
/*-----------------------------------------------------------*/

static void prvRegisterCLICommands( void )
{
    extern void vRegisterPingCommand( void );
    extern void vRegisterPcapCommand( void );
    extern void vRegisterNetStatCommand( void );
    extern void vRegisterTopCommand( void );

    vRegisterPingCommand();
    vRegisterPcapCommand();
    vRegisterNetStatCommand();
    vRegisterTopCommand();
}
/*-----------------------------------------------------------*/

static void prvConfigureMPU( void )
{
    MPU_Region_InitTypeDef MPU_InitStruct;

    HAL_MPU_Disable();

    /*  Configure the MPU attributes of RAM_D2 ( which contains .ethernet_data )
     * as Write back, Read allocate, Write allocate. */
    MPU_InitStruct.Enable = MPU_REGION_ENABLE;
    MPU_InitStruct.BaseAddress = 0x30000000;
    MPU_InitStruct.Size = MPU_REGION_SIZE_256KB;
    MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
    MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;
    MPU_InitStruct.IsCacheable = MPU_ACCESS_NOT_CACHEABLE;
    MPU_InitStruct.IsShareable = MPU_ACCESS_SHAREABLE;
    MPU_InitStruct.Number = MPU_REGION_NUMBER0;
    MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL1;
    MPU_InitStruct.SubRegionDisable = 0x00;
    MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;

    HAL_MPU_ConfigRegion( &( MPU_InitStruct ) );

    HAL_MPU_Enable( MPU_PRIVILEGED_DEFAULT );
}
/*-----------------------------------------------------------*/

static BaseType_t prvIsValidRequest( const uint8_t * pucPacket,
                                     uint32_t ulPacketLength,
                                     uint8_t * pucRequestId )
{
    BaseType_t xValidRequest = pdFALSE;
    PacketHeader_t * header;
    uint16_t usPayloadLength;

