tony-josi-aws/STM32F439ZI_FreeRTOS_TCP_CLI/Lib/FreeRTOS-Plus-CLI/app_main.c
    if( ulPacketLength > PACKET_HEADER_LENGTH )
    {
        header = ( PacketHeader_t * ) pucPacket;
        usPayloadLength = FreeRTOS_ntohs( header->usPayloadLength );

        if( ( header->ucStartMarker == PACKET_START_MARKER ) &&
            ( header->ucPacketNumber == 1 ) &&
            ( ( usPayloadLength + PACKET_HEADER_LENGTH ) == ulPacketLength ) )
        {
            xValidRequest = pdTRUE;
            memcpy( pucRequestId, &( header->ucRequestId[ 0 ] ), 4 );
        }
    }

    return xValidRequest;
}
/*-----------------------------------------------------------*/

#if USE_TCP

    static BaseType_t prvSendResponseEndMarker_TCP( Socket_t xCLIServerSocket,
                                                    struct freertos_sockaddr * pxSourceAddress,
                                                    socklen_t xSourceAddressLength,
                                                    uint8_t * pucPacketNumber,
                                                    uint8_t * pucRequestId )
    {
        BaseType_t ret = pdPASS;
        int32_t lBytes, lSent, lTotalSent;
        PacketHeader_t header;

        header.ucStartMarker = PACKET_START_MARKER;
        header.ucPacketNumber = *pucPacketNumber;
        header.usPayloadLength = 0U;
        memcpy( &( header.ucRequestId[ 0 ] ), pucRequestId, 4 );

        #if USE_TCP_ZERO_COPY
            /* Send response. */

            lBytes = sizeof( PacketHeader_t );
            lSent = 0;
            lTotalSent = 0;

            /* Call send() until all the data has been sent. */
            while( ( lSent >= 0 ) && ( lTotalSent < lBytes ) )
            {
                BaseType_t xAvlSpace = 0;
                BaseType_t xBytesToSend = 0;
                uint8_t * pucTCPZeroCopyStrmBuffer = FreeRTOS_get_tx_head( xCLIServerSocket, &xAvlSpace );

                if( pucTCPZeroCopyStrmBuffer )
                {
                    if( ( lBytes - lTotalSent ) > xAvlSpace )
                    {
                        xBytesToSend = xAvlSpace;
                    }
                    else
                    {
                        xBytesToSend = ( lBytes - lTotalSent );
                    }

                    memcpy( pucTCPZeroCopyStrmBuffer, ( void * ) ( ( ( uint8_t * ) &header ) + lTotalSent ), xBytesToSend );
                }
                else
                {
                    ret = pdFAIL;
                    break;
                }

                lSent = FreeRTOS_send( xCLIServerSocket, NULL, xBytesToSend, 0 );
                lTotalSent += lSent;
            }

            if( lSent < 0 )
            {
                /* Socket closed? */
                ret = pdFAIL;
            }
        #else /* if USE_TCP_ZERO_COPY */
            /* Send response. */

            lBytes = sizeof( PacketHeader_t );
            lSent = 0;
            lTotalSent = 0;

            /* Call send() until all the data has been sent. */
            while( ( lSent >= 0 ) && ( lTotalSent < lBytes ) )
            {
                lSent = FreeRTOS_send( xCLIServerSocket, ( void * ) ( ( ( uint8_t * ) &header ) + lTotalSent ), lBytes - lTotalSent, 0 );
                lTotalSent += lSent;
            }

            if( lSent < 0 )
            {
                /* Socket closed? */
                ret = pdFAIL;
            }
        #endif /* USE_TCP_ZERO_COPY */

        if( lTotalSent != PACKET_HEADER_LENGTH )
        {
            configPRINTF( ( "[ERROR] Failed to last response header.\n" ) );
            ret = pdFAIL;
        }

        return ret;
    }

#endif /* USE_TCP */

/*-----------------------------------------------------------*/

#if USE_UDP

    static BaseType_t prvSendResponseEndMarker( Socket_t xCLIServerSocket,
                                                struct freertos_sockaddr * pxSourceAddress,
                                                socklen_t xSourceAddressLength,
                                                uint8_t * pucPacketNumber,
                                                uint8_t * pucRequestId )
    {
        BaseType_t ret;
        PacketHeader_t header;
        int32_t lBytesSent;

        header.ucStartMarker = PACKET_START_MARKER;
        header.ucPacketNumber = *pucPacketNumber;
        header.usPayloadLength = 0U;
        memcpy( &( header.ucRequestId[ 0 ] ), pucRequestId, 4 );

        #if USE_ZERO_COPY

            /*
             * First obtain a buffer of adequate length from the TCP/IP stack into which
             * the string will be written. */
            #if defined( ipconfigIPv4_BACKWARD_COMPATIBLE ) && ( ipconfigIPv4_BACKWARD_COMPATIBLE == 0 )
                #if 0
                    /*Test to validate if adding 2 internally to requested size cause an overflow in pxGetNetworkBufferWithDescriptor */
                    uint8_t * pucBuffer = FreeRTOS_GetUDPPayloadBuffer_Multi( SIZE_MAX - sizeof( UDPPacket_t ) - 1, portMAX_DELAY, ipTYPE_IPv4 );
                    configASSERT( pucBuffer == NULL );

                    /*Test to validate if adding 2 internally to requested size cause an overflow in pxGetNetworkBufferWithDescriptor */
                    pucBuffer = FreeRTOS_GetUDPPayloadBuffer_Multi( SIZE_MAX - sizeof( UDPPacket_t ) - 2, portMAX_DELAY, ipTYPE_IPv4 );
                    configASSERT( pucBuffer == NULL );

                    /*Test to validate if adding 2 internally to requested size cause an overflow in pxGetNetworkBufferWithDescriptor */
                    pucBuffer = FreeRTOS_GetUDPPayloadBuffer_Multi( SIZE_MAX - sizeof( UDPPacket_t ) - 7, portMAX_DELAY, ipTYPE_IPv4 );
                    configASSERT( pucBuffer == NULL );

                    pucBuffer = FreeRTOS_GetUDPPayloadBuffer_Multi( sizeof( PacketHeader_t ), portMAX_DELAY, ipTYPE_IPv4 );
                    uint8_t * pucBuffer2 = pxResizeNetworkBufferWithDescriptor( pucBuffer, SIZE_MAX - ipBUFFER_PADDING + 1 );
                    configASSERT( pucBuffer2 == NULL );
                    /*FreeRTOS_ReleaseUDPPayloadBuffer(pucBuffer); */
                #endif /* if 0 */
                uint8_t * pucBuffer = FreeRTOS_GetUDPPayloadBuffer_Multi( sizeof( PacketHeader_t ), portMAX_DELAY, ipTYPE_IPv4 );
            #else /* if defined( ipconfigIPv4_BACKWARD_COMPATIBLE ) && ( ipconfigIPv4_BACKWARD_COMPATIBLE == 0 ) */
                uint8_t * pucBuffer = FreeRTOS_GetUDPPayloadBuffer( sizeof( PacketHeader_t ), portMAX_DELAY );
            #endif /* if defined( ipconfigIPv4_BACKWARD_COMPATIBLE ) && ( ipconfigIPv4_BACKWARD_COMPATIBLE == 0 ) */
            configASSERT( pucBuffer != NULL );
            memcpy( pucBuffer, &header, sizeof( PacketHeader_t ) );


