tony-josi-aws/STM32F439ZI_FreeRTOS_TCP_CLI/Lib/FreeRTOS-Plus-CLI/app_main.c
            #if USE_TCP_ZERO_COPY
                /* Send response. */

                lBytes = ulBytesToSend + PACKET_HEADER_LENGTH;
                lSent = 0;
                lTotalSent = 0;

                /* Call send() until all the data has been sent. */
                while( ( lSent >= 0 ) && ( lTotalSent < lBytes ) )
                {
                    BaseType_t xAvlSpace = 0;
                    BaseType_t xBytesToSend = 0;
                    uint8_t * pucTCPZeroCopyStrmBuffer = FreeRTOS_get_tx_head( xCLIServerSocket, &xAvlSpace );

                    if( pucTCPZeroCopyStrmBuffer )
                    {
                        if( ( lBytes - lTotalSent ) > xAvlSpace )
                        {
                            xBytesToSend = xAvlSpace;
                        }
                        else
                        {
                            xBytesToSend = ( lBytes - lTotalSent );
                        }

                        memcpy( pucTCPZeroCopyStrmBuffer, ( void * ) ( ( ( uint8_t * ) ucTcpResponseBuffer ) + lTotalSent ), xBytesToSend );
                    }
                    else
                    {
                        ret = pdFAIL;
                        break;
                    }

                    lSent = FreeRTOS_send( xCLIServerSocket, NULL, xBytesToSend, 0 );
                    lTotalSent += lSent;
                }

                if( lSent < 0 )
                {
                    /* Socket closed? */
                    break;
                }
            #else /* if USE_TCP_ZERO_COPY */
                /* Send response. */

                lBytes = ulBytesToSend + PACKET_HEADER_LENGTH;
                lSent = 0;
                lTotalSent = 0;

                /* Call send() until all the data has been sent. */
                while( ( lSent >= 0 ) && ( lTotalSent < lBytes ) )
                {
                    lSent = FreeRTOS_send( xCLIServerSocket, ucTcpResponseBuffer + lTotalSent, lBytes - lTotalSent, 0 );
                    lTotalSent += lSent;
                }

                if( lSent < 0 )
                {
                    /* Socket closed? */
                    break;
                }
            #endif /* USE_TCP_ZERO_COPY */

            if( lTotalSent != ( ulBytesToSend + PACKET_HEADER_LENGTH ) )
            {
                configPRINTF( ( "[ERROR] Failed to send response.\n" ) );
                ret = pdFAIL;
                break;
            }

            ulRemainingBytes -= ( lTotalSent - PACKET_HEADER_LENGTH );
        }

        return ret;
    }

    #if TCP_ECHO_RECV_DATA
        static BaseType_t prvSendResponseBytes_TCP( Socket_t xCLIServerSocket,
                                                    const uint8_t * pucResponse,
                                                    uint32_t ulResponseLength )
        {
            BaseType_t ret = pdPASS;
            int32_t lBytes, lSent, lTotalSent;

            lBytes = ulResponseLength;
            lSent = 0;
            lTotalSent = 0;

            /* Call send() until all the data has been sent. */
            while( ( lSent >= 0 ) && ( lTotalSent < lBytes ) )
            {
                lSent = FreeRTOS_send( xCLIServerSocket, pucResponse, lBytes - lTotalSent, 0 );
                lTotalSent += lSent;
            }

            if( lSent < 0 )
            {
                /* Socket closed? */
                ret = pdFAIL;
            }

            return ret;
        }

    #endif /* TCP_ECHO_RECV_DATA */

#endif /* if USE_TCP */

/*-----------------------------------------------------------*/

uint32_t ulApplicationGetNextSequenceNumber( uint32_t ulSourceAddress,
                                             uint16_t usSourcePort,
                                             uint32_t ulDestinationAddress,
                                             uint16_t usDestinationPort )
{
    uint32_t ulReturn;

    ( void ) ulSourceAddress;
    ( void ) usSourcePort;
    ( void ) ulDestinationAddress;
    ( void ) usDestinationPort;

    xApplicationGetRandomNumber( &ulReturn );

    return ulReturn;
}
/*-----------------------------------------------------------*/

static void network_up_status_thread_fn( void * io_params )
{
    while( 1 )
    {
        if( network_up == 0 )
        {
            ulTaskNotifyTake( pdTRUE, portMAX_DELAY );
        }

        for( int i = 0; i < 4; ++i )
        {
            HAL_GPIO_TogglePin( GPIOB, GPIO_PIN_7 );
            vTaskDelay( 50 );
        }

        vTaskDelay( 200 );
        HAL_GPIO_TogglePin( GPIOB, GPIO_PIN_14 );
        HAL_GPIO_TogglePin( GPIOB, GPIO_PIN_0 );
        vTaskDelay( 20 );
        HAL_GPIO_TogglePin( GPIOB, GPIO_PIN_14 );
        HAL_GPIO_TogglePin( GPIOB, GPIO_PIN_0 );
    }
}

#if defined( ipconfigIPv4_BACKWARD_COMPATIBLE ) && ( ipconfigIPv4_BACKWARD_COMPATIBLE == 0 )
    void vApplicationIPNetworkEventHook_Multi( eIPCallbackEvent_t eNetworkEvent,
                                               struct xNetworkEndPoint * pxEndPoint )
#else
    void vApplicationIPNetworkEventHook( eIPCallbackEvent_t eNetworkEvent )
#endif /* defined(ipconfigIPv4_BACKWARD_COMPATIBLE) && ( ipconfigIPv4_BACKWARD_COMPATIBLE == 0 ) */
{
    /* If the network has just come up...*/
    if( eNetworkEvent == eNetworkUp )
    {
        xUpEndPointCount += 1;

        if( xUpEndPointCount >= TOTAL_ENDPOINTS )
        {
            /* Create the tasks that use the IP stack if they have not already been
             * created. */
            if( xTasksAlreadyCreated == pdFALSE )
            {
                xTasksAlreadyCreated = pdTRUE;

                #if ( ipconfigUSE_IPv4 != 0 )
                #if ( mainCREATE_TCP_LOOPBACK_TASK_SINGLE == 1 && USE_LOOPBACK_INTERFACE == 1 )
                    {
                        BaseType_t rc = FreeRTOS_inet_pton( FREERTOS_AF_INET, "127.0.0.1", ( void * ) &( xParamsLoopBackServerAddr.sin_address.ulIP_IPv4 ) );
                        configASSERT( rc == pdPASS );
                        xParamsLoopBackServerAddr.sin_port = FreeRTOS_htons( tcpechoPORT_NUMBER );
                        xParamsLoopBackServerAddr.sin_family = FREERTOS_AF_INET;

                        extern void vStartSimpleTCPServerTasks( uint16_t usStackSize,
                                                                UBaseType_t uxPriority,
                                                                struct freertos_sockaddr * pxParams );
                        vStartSimpleTCPServerTasks( mainCLI_TASK_STACK_SIZE * 4, mainCLI_TASK_PRIORITY, &xParamsLoopBackServerAddr );

                        extern void vStartTCPEchoClientTasks_SingleTasks( uint16_t usTaskStackSize,
                                                                          UBaseType_t uxTaskPriority );
                        vStartTCPEchoClientTasks_SingleTasks( mainCLI_TASK_STACK_SIZE * 4, mainCLI_TASK_PRIORITY );
                    }
                    #endif /* if ( mainCREATE_TCP_LOOPBACK_TASK_SINGLE == 1 && USE_LOOPBACK_INTERFACE == 1 ) */

                    #if USE_UDP
                        /* Sockets, and tasks that use the TCP/IP stack can be created here. */
                        xTaskCreate( prvCliTask,
                                     "CLI_UDP_Server",
                                     mainCLI_TASK_STACK_SIZE,
                                     NULL,
                                     mainCLI_TASK_PRIORITY,
                                     NULL );
                    #endif

                    #if USE_TCP
                        /* Sockets, and tasks that use the TCP/IP stack can be created here. */
                        xTaskCreate( prvCliTask_TCP,
                                     "CLI_TCP_Server",
                                     mainCLI_TASK_STACK_SIZE,
                                     NULL,
                                     mainCLI_TASK_PRIORITY,
                                     NULL );
                    #endif

                    #if ( BUILD_IPERF3 == 1 )
                        #if USE_IPERF3
                            vIPerfInstall();
                        #endif /* USE_IPERF3 */
                    #endif /* ( BUILD_IPERF3 == 1 ) */
                #endif /* ( ipconfigUSE_IPv4 != 0) */

                #if USE_USER_COMMAND_TASK
                    /* Sockets, and tasks that use the TCP/IP stack can be created here. */
                    xTaskCreate( prvServerWorkTask,
                                 "user_cmnd_task",
                                 mainUSER_COMMAND_TASK_STACK_SIZE,
                                 NULL,
                                 mainUSER_COMMAND_TASK_PRIORITY,
                                 NULL );
                #endif


