tony-josi-aws/STM32F439ZI_FreeRTOS_TCP_CLI/Lib/FreeRTOS-Plus-CLI/app_main.c
                #if USE_TCP_ECHO_CLIENT
                    void vStartTCPEchoClientTasks_SingleTasks( uint16_t usTaskStackSize,
                                                               UBaseType_t uxTaskPriority );
                    vStartTCPEchoClientTasks_SingleTasks( mainCLI_TASK_STACK_SIZE, mainCLI_TASK_PRIORITY );
                #endif


                #if USE_UDP_ECHO_SERVER
                    extern static void prvSimpleServerTask( void * pvParameters );
                    xTaskCreate( prvSimpleServerTask, "SimpCpySrvr", 2048, UDP_ECHO_PORT, tskIDLE_PRIORITY, NULL );
                #endif /* USE_UDP_ECHO_SERVER */

                #if USE_TCP_ECHO_SERVER
                {
                    xParamsTCPEchoServerAddr.sin_port = FreeRTOS_htons( tcpechoPORT_NUMBER );
                    xParamsTCPEchoServerAddr.sin_family = FREERTOS_AF_INET;

                    extern void vStartSimpleTCPServerTasks( uint16_t usStackSize,
                                                            UBaseType_t uxPriority,
                                                            struct freertos_sockaddr * pxParams );
                    vStartSimpleTCPServerTasks( mainCLI_TASK_STACK_SIZE, mainCLI_TASK_PRIORITY, &xParamsTCPEchoServerAddr );
                }
                #endif /* USE_TCP_ECHO_SERVER */

                #if USE_CORE_HTTP_DEMO
                    extern void vStartSimpleHTTPDemo( void );
                    vStartSimpleHTTPDemo();
                #endif /* USE_CORE_HTTP_DEMO */


                network_up = 1;
                xTaskNotifyGive( network_up_task_handle );
            }
        }

        #if defined( ipconfigIPv4_BACKWARD_COMPATIBLE ) && ( ipconfigIPv4_BACKWARD_COMPATIBLE == 0 )
            showEndPoint( pxEndPoint );
        #else
        {
            uint32_t ulIPAddress, ulNetMask, ulGatewayAddress, ulDNSServerAddress;
            char cBuffer[ 16 ];

            /* Print out the network configuration, which may have come from a DHCP
             * server. */
            #if defined( ipconfigIPv4_BACKWARD_COMPATIBLE ) && ( ipconfigIPv4_BACKWARD_COMPATIBLE == 0 )
                FreeRTOS_GetEndPointConfiguration( &ulIPAddress, &ulNetMask, &ulGatewayAddress, &ulDNSServerAddress, pxNetworkEndPoints );
            #else
                FreeRTOS_GetAddressConfiguration( &ulIPAddress, &ulNetMask, &ulGatewayAddress, &ulDNSServerAddress );
            #endif /* defined(ipconfigIPv4_BACKWARD_COMPATIBLE) && ( ipconfigIPv4_BACKWARD_COMPATIBLE == 0 ) */

            FreeRTOS_inet_ntoa( ulIPAddress, cBuffer );
            configPRINTF( ( "IP Address: %s\n", cBuffer ) );

            FreeRTOS_inet_ntoa( ulNetMask, cBuffer );
            configPRINTF( ( "Subnet Mask: %s\n", cBuffer ) );

            FreeRTOS_inet_ntoa( ulGatewayAddress, cBuffer );
            configPRINTF( ( "Gateway Address: %s\n", cBuffer ) );

            FreeRTOS_inet_ntoa( ulDNSServerAddress, cBuffer );
            configPRINTF( ( "DNS Server Address: %s\n", cBuffer ) );
        }
        #endif /* defined(ipconfigIPv4_BACKWARD_COMPATIBLE) && ( ipconfigIPv4_BACKWARD_COMPATIBLE == 0 ) */
    }
    else if( eNetworkEvent == eNetworkDown )
    {
        network_up = 0;
    }
}
/*-----------------------------------------------------------*/

#if ( ipconfigUSE_LLMNR != 0 ) || ( ipconfigUSE_NBNS != 0 )

    #if defined( ipconfigIPv4_BACKWARD_COMPATIBLE ) && ( ipconfigIPv4_BACKWARD_COMPATIBLE == 0 )
        BaseType_t xApplicationDNSQueryHook_Multi( struct xNetworkEndPoint * pxEndPoint,
                                                   const char * pcName )
    #else
        BaseType_t xApplicationDNSQueryHook( const char * pcName )
    #endif /* defined(ipconfigIPv4_BACKWARD_COMPATIBLE) && ( ipconfigIPv4_BACKWARD_COMPATIBLE == 0 ) */
    {
        BaseType_t xReturn = pdFAIL;

        /* Determine if a name lookup is for this node.  Two names are given
         * to this node: that returned by pcApplicationHostnameHook() and that set
         * by mainDEVICE_NICK_NAME. */
        if( strcasecmp( pcName, pcApplicationHostnameHook() ) == 0 )
        {
            xReturn = pdPASS;
        }

        return xReturn;
    }

#endif /* ( ipconfigUSE_LLMNR != 0 ) || ( ipconfigUSE_NBNS != 0 ) */

/*-----------------------------------------------------------*/

const char * pcApplicationHostnameHook( void )
{
    /* Assign the name "STM32H7" to this network node.  This function will be
     * called during the DHCP: the machine will be registered with an IP address
     * plus this name. */
    return "STM32H7";
}
/*-----------------------------------------------------------*/

BaseType_t xApplicationGetRandomNumber( uint32_t * pulValue )
{
    BaseType_t xReturn;

    if( HAL_RNG_GenerateRandomNumber( &hrng, pulValue ) == HAL_OK )
    {
        xReturn = pdPASS;
    }
    else
    {
        xReturn = pdFAIL;
    }

    return xReturn;
}
/*-----------------------------------------------------------*/

void vPrintStringToUart( const char * str )
{
    HAL_UART_Transmit( &( huart3 ), ( const uint8_t * ) str, strlen( str ), 1000 );
}
/*-----------------------------------------------------------*/

void vIncrementTim7Tick( void )
{
    ulTim7Tick++;
}
/*-----------------------------------------------------------*/

uint32_t ulGetTim7Tick( void )
{
    return ulTim7Tick;
}
/*-----------------------------------------------------------*/

/* void vApplicationStackOverflowHook( TaskHandle_t pxTask, char *pcTaskName ) */
/* { */
/*     / * If configCHECK_FOR_STACK_OVERFLOW is set to either 1 or 2 then this */
/*      * function will automatically get called if a task overflows its stack. * / */
/*     ( void ) pxTask; */
/*     ( void ) pcTaskName; */
/*     for( ;; ); */
/* } */
/* / *-----------------------------------------------------------* / */

void vApplicationMallocFailedHook( void )
{
    /* If configUSE_MALLOC_FAILED_HOOK is set to 1 then this function will
     * be called automatically if a call to pvPortMalloc() fails.  pvPortMalloc()
     * is called automatically when a task, queue or semaphore is created. */
    for( ; ; )
    {
    }
}
/*-----------------------------------------------------------*/

/* configUSE_STATIC_ALLOCATION is set to 1, so the application must provide an
 * implementation of vApplicationGetIdleTaskMemory() to provide the memory that is
 * used by the Idle task. */
void vApplicationGetIdleTaskMemory( StaticTask_t ** ppxIdleTaskTCBBuffer,
                                    StackType_t ** ppxIdleTaskStackBuffer,
                                    uint32_t * pulIdleTaskStackSize )
{
/* If the buffers to be provided to the Idle task are declared inside this
 * function then they must be declared static - otherwise they will be allocated on
 * the stack and so not exists after this function exits. */
    static StaticTask_t xIdleTaskTCB;
    static StackType_t uxIdleTaskStack[ configMINIMAL_STACK_SIZE ];

    /* Pass out a pointer to the StaticTask_t structure in which the Idle task's
     * state will be stored. */
    *ppxIdleTaskTCBBuffer = &xIdleTaskTCB;

    /* Pass out the array that will be used as the Idle task's stack. */
    *ppxIdleTaskStackBuffer = uxIdleTaskStack;

    /* Pass out the size of the array pointed to by *ppxIdleTaskStackBuffer.
     * Note that, as the array is necessarily of type StackType_t,
     * configMINIMAL_STACK_SIZE is specified in words, not bytes. */
    *pulIdleTaskStackSize = configMINIMAL_STACK_SIZE;
}
/*-----------------------------------------------------------*/

/* configUSE_STATIC_ALLOCATION and configUSE_TIMERS are both set to 1, so the
 * application must provide an implementation of vApplicationGetTimerTaskMemory()
 * to provide the memory that is used by the Timer service task. */
void vApplicationGetTimerTaskMemory( StaticTask_t ** ppxTimerTaskTCBBuffer,
                                     StackType_t ** ppxTimerTaskStackBuffer,
                                     uint32_t * pulTimerTaskStackSize )
{
/* If the buffers to be provided to the Timer task are declared inside this
 * function then they must be declared static - otherwise they will be allocated on
 * the stack and so not exists after this function exits. */
    static StaticTask_t xTimerTaskTCB;
    static StackType_t uxTimerTaskStack[ configTIMER_TASK_STACK_DEPTH ];

