tony-josi-aws/STM32F439ZI_FreeRTOS_TCP_CLI/Lib/FreeRTOS-Plus-CLI/app_main.c
    /* Pass out a pointer to the StaticTask_t structure in which the Timer
     * task's state will be stored. */
    *ppxTimerTaskTCBBuffer = &xTimerTaskTCB;

    /* Pass out the array that will be used as the Timer task's stack. */
    *ppxTimerTaskStackBuffer = uxTimerTaskStack;

    /* Pass out the size of the array pointed to by *ppxTimerTaskStackBuffer.
     * Note that, as the array is necessarily of type StackType_t,
     * configMINIMAL_STACK_SIZE is specified in words, not bytes. */
    *pulTimerTaskStackSize = configTIMER_TASK_STACK_DEPTH;
}

/*-----------------------------------------------------------*/
/*-----------------------------------------------------------*/
/*-----------------------------------------------------------*/
/**************  ST CUBE IDE GENERATED CODE  *****************/
/*-----------------------------------------------------------*/
/*-----------------------------------------------------------*/
/*-----------------------------------------------------------*/

/**
 * @brief ETH MSP Initialization
 * This function configures the hardware resources used in this example
 * @param heth: ETH handle pointer
 * @retval None
 */
void HAL_ETH_MspInit( ETH_HandleTypeDef * heth )
{
    GPIO_InitTypeDef GPIO_InitStruct = { 0 };

    if( heth->Instance == ETH )
    {
        /* USER CODE BEGIN ETH_MspInit 0 */

        /* USER CODE END ETH_MspInit 0 */
        /* Peripheral clock enable */
        __HAL_RCC_ETH_CLK_ENABLE();

        __HAL_RCC_GPIOC_CLK_ENABLE();
        __HAL_RCC_GPIOA_CLK_ENABLE();
        __HAL_RCC_GPIOB_CLK_ENABLE();
        __HAL_RCC_GPIOG_CLK_ENABLE();

        /**ETH GPIO Configuration
         * PC1     ------> ETH_MDC
         * PA1     ------> ETH_REF_CLK
         * PA2     ------> ETH_MDIO
         * PA7     ------> ETH_CRS_DV
         * PC4     ------> ETH_RXD0
         * PC5     ------> ETH_RXD1
         * PB13     ------> ETH_TXD1
         * PG11     ------> ETH_TX_EN
         * PG13     ------> ETH_TXD0
         */
        GPIO_InitStruct.Pin = RMII_MDC_Pin | RMII_RXD0_Pin | RMII_RXD1_Pin;
        GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
        GPIO_InitStruct.Alternate = GPIO_AF11_ETH;
        HAL_GPIO_Init( GPIOC, &GPIO_InitStruct );

        GPIO_InitStruct.Pin = RMII_REF_CLK_Pin | RMII_MDIO_Pin | RMII_CRS_DV_Pin;
        GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
        GPIO_InitStruct.Alternate = GPIO_AF11_ETH;
        HAL_GPIO_Init( GPIOA, &GPIO_InitStruct );

        GPIO_InitStruct.Pin = RMII_TXD1_Pin;
        GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
        GPIO_InitStruct.Alternate = GPIO_AF11_ETH;
        HAL_GPIO_Init( RMII_TXD1_GPIO_Port, &GPIO_InitStruct );

        GPIO_InitStruct.Pin = RMII_TX_EN_Pin | RMII_TXD0_Pin;
        GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
        GPIO_InitStruct.Alternate = GPIO_AF11_ETH;
        HAL_GPIO_Init( GPIOG, &GPIO_InitStruct );

        /* ETH interrupt Init */
        HAL_NVIC_SetPriority( ETH_IRQn, 5, 0 );
        HAL_NVIC_EnableIRQ( ETH_IRQn );
        HAL_NVIC_SetPriority( ETH_WKUP_IRQn, 5, 0 );
        HAL_NVIC_EnableIRQ( ETH_WKUP_IRQn );
        /* USER CODE BEGIN ETH_MspInit 1 */

        /* USER CODE END ETH_MspInit 1 */
    }
}

/**
 * @brief ETH MSP De-Initialization
 * This function freeze the hardware resources used in this example
 * @param heth: ETH handle pointer
 * @retval None
 */
void HAL_ETH_MspDeInit( ETH_HandleTypeDef * heth )
{
    if( heth->Instance == ETH )
    {
        /* USER CODE BEGIN ETH_MspDeInit 0 */

        /* USER CODE END ETH_MspDeInit 0 */
        /* Peripheral clock disable */
        __HAL_RCC_ETH_CLK_DISABLE();

        /**ETH GPIO Configuration
         * PC1     ------> ETH_MDC
         * PA1     ------> ETH_REF_CLK
         * PA2     ------> ETH_MDIO
         * PA7     ------> ETH_CRS_DV
         * PC4     ------> ETH_RXD0
         * PC5     ------> ETH_RXD1
         * PB13     ------> ETH_TXD1
         * PG11     ------> ETH_TX_EN
         * PG13     ------> ETH_TXD0
         */
        HAL_GPIO_DeInit( GPIOC, RMII_MDC_Pin | RMII_RXD0_Pin | RMII_RXD1_Pin );

        HAL_GPIO_DeInit( GPIOA, RMII_REF_CLK_Pin | RMII_MDIO_Pin | RMII_CRS_DV_Pin );

        HAL_GPIO_DeInit( RMII_TXD1_GPIO_Port, RMII_TXD1_Pin );

        HAL_GPIO_DeInit( GPIOG, RMII_TX_EN_Pin | RMII_TXD0_Pin );

        /* ETH interrupt DeInit */
        HAL_NVIC_DisableIRQ( ETH_IRQn );
        HAL_NVIC_DisableIRQ( ETH_WKUP_IRQn );
        /* USER CODE BEGIN ETH_MspDeInit 1 */

        /* USER CODE END ETH_MspDeInit 1 */
    }
}

#if USE_UDP_ECHO_SERVER
    static void prvSimpleServerTask( void * pvParameters )
    {
        int32_t lBytes;
        uint8_t cReceivedString[ 512 ];
        struct freertos_sockaddr xClient, xBindAddress;
        uint32_t xClientLength = sizeof( xClient );
        Socket_t xListeningSocket;
        int32_t lBytesSent;
        TickType_t xCLIServerRecvTimeout = portMAX_DELAY;
        uint8_t cPrio = 3;
        BaseType_t xSocketRet;

        /* Just to prevent compiler warnings. */
        ( void ) pvParameters;

        /* Attempt to open the socket. */
        xListeningSocket = FreeRTOS_socket( FREERTOS_AF_INET, FREERTOS_SOCK_DGRAM, FREERTOS_IPPROTO_UDP );

        configASSERT( xListeningSocket != FREERTOS_INVALID_SOCKET );

        xSocketRet = FreeRTOS_setsockopt( xListeningSocket, 0, FREERTOS_SO_SOCKET_PRIORITY, &cPrio, sizeof( cPrio ) );

        configASSERT( xSocketRet == pdPASS );

        /* No need to return from FreeRTOS_recvfrom until a message
         * is received. */
        FreeRTOS_setsockopt( xListeningSocket,
                             0,
                             FREERTOS_SO_RCVTIMEO,
                             &( xCLIServerRecvTimeout ),
                             sizeof( TickType_t ) );

        /* This test receives data sent from a different port on the same IP
         * address.  Configure the freertos_sockaddr structure with the address being
         * bound to.  The strange casting is to try and remove	compiler warnings on 32
         * bit machines.  Note that this task is only created after the network is up,
         * so the IP address is valid here. */
        xBindAddress.sin_port = ( uint16_t ) ( ( uint32_t ) pvParameters ) & 0xffffUL;
        xBindAddress.sin_port = FreeRTOS_htons( xBindAddress.sin_port );
        xBindAddress.sin_family = FREERTOS_AF_INET;

