tony-josi-aws/STM32F439ZI_FreeRTOS_TCP_CLI/Lib/FreeRTOS-Plus-CLI/app_main.c
        /* Bind the socket to the port that the client task will send to. */
        FreeRTOS_bind( xListeningSocket, &xBindAddress, sizeof( xBindAddress ) );

        FreeRTOS_printf( ( "********* UDP ECHO ***********\n" ) );

        for( ; ; )
        {
            lBytes = 0;
            uint8_t cRXString[ 512 ] = { '\0' };
            char * cRX_Prefix = "TI AM243x >>> ";

            /* Zero out the receive array so there is NULL at the end of the string
             * when it is printed out. */
            memset( cReceivedString, 0x00, sizeof( cReceivedString ) );

            /* Receive data on the socket.  ulFlags is zero, so the zero copy option
             * is not set and the received data is copied into the buffer pointed to by
             * cReceivedString.  By default the block time is portMAX_DELAY.
             * xClientLength is not actually used by FreeRTOS_recvfrom(), but is set
             * appropriately in case future versions do use it. */

            #if USE_ZERO_COPY
                uint8_t * pucReceivedUDPPayload = NULL;

                lBytes = FreeRTOS_recvfrom( xListeningSocket, &pucReceivedUDPPayload, 0, FREERTOS_ZERO_COPY, &xClient, &xClientLength );

                configASSERT( ( pucReceivedUDPPayload != NULL ) );

                memcpy( ( void * ) ( cReceivedString ), pucReceivedUDPPayload, lBytes );

                FreeRTOS_ReleaseUDPPayloadBuffer( ( void * ) pucReceivedUDPPayload );
            #else
                lBytes = FreeRTOS_recvfrom( xListeningSocket, cReceivedString, sizeof( cReceivedString ), 0, &xClient, &xClientLength );
            #endif /* USE_ZERO_COPY */

            if( lBytes > 0 )
            {
                configASSERT( lBytes < ( 512 - strlen( cRX_Prefix ) ) );
                memcpy( cRXString, cRX_Prefix, strlen( cRX_Prefix ) );
                memcpy( cRXString + strlen( cRX_Prefix ), cReceivedString, lBytes );

                #if USE_ZERO_COPY

                    /*
                     * First obtain a buffer of adequate length from the TCP/IP stack into which
                     * the string will be written.
                     */
                    #if defined( ipconfigIPv4_BACKWARD_COMPATIBLE ) && ( ipconfigIPv4_BACKWARD_COMPATIBLE == 0 )
                        uint8_t * pucBuffer = FreeRTOS_GetUDPPayloadBuffer_Multi( lBytes + strlen( cRX_Prefix ), portMAX_DELAY, ipTYPE_IPv4 );
                    #else
                        uint8_t * pucBuffer = FreeRTOS_GetUDPPayloadBuffer( lBytes + strlen( cRX_Prefix ), portMAX_DELAY );
                    #endif

                    configASSERT( pucBuffer != NULL );
                    memcpy( pucBuffer, cRXString, lBytes + strlen( cRX_Prefix ) );

                    /* Send response. */
                    /*vTaskSuspendAll(); */
                    /*time_check = ARM_REG_DWT_CYCCNT; */
                    lBytesSent = FreeRTOS_sendto( xListeningSocket,
                                                  ( void * ) pucBuffer,
                                                  lBytes + strlen( cRX_Prefix ),
                                                  FREERTOS_ZERO_COPY,
                                                  &xClient, xClientLength );
                    /*time_check = ARM_REG_DWT_CYCCNT - time_check; */
                    /*xTaskResumeAll(); */
                    FreeRTOS_debug_printf( ( "FreeRTOS_sendto: DELTA: %u\r\n", time_check ) );
                #else /* if USE_ZERO_COPY */
                    /* Send response. */
                    FreeRTOS_sendto( xListeningSocket, cRXString, lBytes + strlen( cRX_Prefix ), 0, &xClient, xClientLength );
                #endif /* USE_ZERO_COPY */
            }
        }
    }
#endif /* USE_UDP_ECHO_SERVER */

void vApplicationGetRandomHeapCanary( portPOINTER_SIZE_TYPE * pxHeapCanary )
{
    if( pxHeapCanary != NULL )
    {
        xApplicationGetRandomNumber( pxHeapCanary );
    }
}
